TexasInstruments/c2000ware-core-sdk/driverlib/f28003x/driverlib/inc/hw_memcfg.h
//###########################################################################
//
// FILE:    hw_memcfg.h
//
// TITLE:   Definitions for the MEMCFG registers.
//
//###########################################################################
// $Copyright:
// Copyright (C) 2026 Texas Instruments Incorporated - http://www.ti.com/
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

#ifndef HW_MEMCFG_H
#define HW_MEMCFG_H

//*************************************************************************************************
//
// The following are defines for the MEMCFG register offsets
//
//*************************************************************************************************
#define MEMCFG_O_DXLOCK             0x0U    // Dedicated RAM Config Lock Register
#define MEMCFG_O_DXCOMMIT           0x2U    // Dedicated RAM Config Lock Commit Register
#define MEMCFG_O_DXACCPROT0         0x8U    // Dedicated RAM Config Register
#define MEMCFG_O_DXTEST             0x10U   // Dedicated RAM TEST Register
#define MEMCFG_O_DXINIT             0x12U   // Dedicated RAM Init Register
#define MEMCFG_O_DXINITDONE         0x14U   // Dedicated RAM InitDone Status Register
#define MEMCFG_O_DXRAMTEST_LOCK     0x16U   // Lock register to Dx RAM TEST registers
#define MEMCFG_O_LSXLOCK            0x20U   // Local Shared RAM Config Lock Register
#define MEMCFG_O_LSXCOMMIT          0x22U   // Local Shared RAM Config Lock Commit Register
#define MEMCFG_O_LSXMSEL            0x24U   // Local Shared RAM Master Sel Register
#define MEMCFG_O_LSXCLAPGM          0x26U   // Local Shared RAM Prog/Exe control Register
#define MEMCFG_O_LSXACCPROT0        0x28U   // Local Shared RAM Config Register 0
#define MEMCFG_O_LSXACCPROT1        0x2AU   // Local Shared RAM Config Register 1
#define MEMCFG_O_LSXTEST            0x30U   // Local Shared RAM TEST Register
#define MEMCFG_O_LSXINIT            0x32U   // Local Shared RAM Init Register
#define MEMCFG_O_LSXINITDONE        0x34U   // Local Shared RAM InitDone Status Register
#define MEMCFG_O_LSXRAMTEST_LOCK    0x36U   // Lock register to LSx RAM TEST registers
#define MEMCFG_O_GSXLOCK            0x40U   // Global Shared RAM Config Lock Register
#define MEMCFG_O_GSXCOMMIT          0x42U   // Global Shared RAM Config Lock Commit Register
#define MEMCFG_O_GSXACCPROT0        0x48U   // Global Shared RAM Config Register 0
#define MEMCFG_O_GSXTEST            0x50U   // Global Shared RAM TEST Register
#define MEMCFG_O_GSXINIT            0x52U   // Global Shared RAM Init Register
#define MEMCFG_O_GSXINITDONE        0x54U   // Global Shared RAM InitDone Status Register
#define MEMCFG_O_GSXRAMTEST_LOCK    0x56U   // Lock register to GSx RAM TEST registers
#define MEMCFG_O_MSGXLOCK           0x60U   // Message RAM Config Lock Register
#define MEMCFG_O_MSGXCOMMIT         0x62U   // Message RAM Config Lock Commit Register
#define MEMCFG_O_MSGXTEST           0x70U   // Message RAM TEST Register
#define MEMCFG_O_MSGXINIT           0x72U   // Message RAM Init Register
#define MEMCFG_O_MSGXINITDONE       0x74U   // Message RAM InitDone Status Register
#define MEMCFG_O_MSGXRAMTEST_LOCK   0x76U   // Lock register for MSGx RAM TEST Register
#define MEMCFG_O_ROM_LOCK           0xA0U   // ROM Config Lock Register
#define MEMCFG_O_ROM_TEST           0xA2U   // ROM  TEST Register
#define MEMCFG_O_ROM_FORCE_ERROR    0xA4U   // ROM Force Error register

#define MEMCFG_O_NMAVFLG           0x0U                     // Non-Master Access Violation Flag
                                                            // Register
#define MEMCFG_O_NMAVSET           0x2U                     // Non-Master Access Violation Flag Set
                                                            // Register
#define MEMCFG_O_NMAVCLR           0x4U                     // Non-Master Access Violation Flag
                                                            // Clear Register
#define MEMCFG_O_NMAVINTEN         0x6U                     // Non-Master Access Violation
                                                            // Interrupt Enable Register
#define MEMCFG_O_NMCPURDAVADDR     0x8U                     // Non-Master CPU Read Access Violation
                                                            // Address
#define MEMCFG_O_NMCPUWRAVADDR     0xAU                     // Non-Master CPU Write Access
                                                            // Violation Address
#define MEMCFG_O_NMCPUFAVADDR      0xCU                     // Non-Master CPU Fetch Access
                                                            // Violation Address
#define MEMCFG_O_NMDMAWRAVADDR     0xEU                     // Non-Master DMA Write Access
                                                            // Violation Address
#define MEMCFG_O_NMCLA1RDAVADDR    0x10U                    // Non-Master CLA1 Read Access
                                                            // Violation Address
#define MEMCFG_O_NMCLA1WRAVADDR    0x12U                    // Non-Master CLA1 Write Access
                                                            // Violation Address
#define MEMCFG_O_NMCLA1FAVADDR     0x14U                    // Non-Master CLA1 Fetch Access
                                                            // Violation Address
#define MEMCFG_O_NMDMARDAVADDR     0x1CU                    // Non-Master DMA Read Access Violation
                                                            // Address
#define MEMCFG_O_MAVFLG            0x20U                    // Master Access Violation Flag
                                                            // Register
#define MEMCFG_O_MAVSET            0x22U                    // Master Access Violation Flag Set
                                                            // Register
#define MEMCFG_O_MAVCLR            0x24U                    // Master Access Violation Flag Clear
                                                            // Register
#define MEMCFG_O_MAVINTEN          0x26U                    // Master Access Violation Interrupt
                                                            // Enable Register
#define MEMCFG_O_MCPUFAVADDR       0x28U                    // Master CPU Fetch Access Violation
                                                            // Address
#define MEMCFG_O_MCPUWRAVADDR      0x2AU                    // Master CPU Write Access Violation
                                                            // Address
#define MEMCFG_O_MDMAWRAVADDR      0x2CU                    // Master  DMA Write Access Violation
                                                            // Address
#define MEMCFG_O_MHICWRAVADDR(i)   (0x2EU + ((i) * 0x2U))   // (0 <= i < 2) Master  HIC Write
                                                            // Access Violation Address
#define MEMCFG_O_NMHICRDAVADDR     0x3CU                    // Non-Master HIC Read Access Violation
                                                            // Address
#define MEMCFG_O_NMHICWRAVADDR     0x3EU                    // Non-Master HIC Write Access
                                                            // Violation Address

