TexasInstruments/c2000ware-core-sdk/driverlib/f28003x/driverlib/inc/hw_memcfg.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the MSGxINITDONE register
//
//*************************************************************************************************
#define MEMCFG_MSGXINITDONE_INITDONE_CPUTOCLA1   0x2U    // Initialization status for CPU to CLA1
                                                         // MSG RAM
#define MEMCFG_MSGXINITDONE_INITDONE_CLA1TOCPU   0x4U    // Initialization status for CLA1 to CPU
                                                         // MSG RAM
#define MEMCFG_MSGXINITDONE_INITDONE_CLA1TODMA   0x20U   // Initialization status for CLA1 to DMA
                                                         // MSG RAM
#define MEMCFG_MSGXINITDONE_INITDONE_DMATOCLA1   0x40U   // Initialization status for DMA to CLA1
                                                         // MSG RAM

//*************************************************************************************************
//
// The following are defines for the bit fields in the MSGxRAMTEST_LOCK register
//
//*************************************************************************************************
#define MEMCFG_MSGXRAMTEST_LOCK_CPUTOCLA1   0x2U          // MSGxRAMTEST_LOCK.CPUTOCLA1Lock
                                                          // Configuration
#define MEMCFG_MSGXRAMTEST_LOCK_CLA1TOCPU   0x4U          // MSGxRAMTEST_LOCK.CLA1TOCPULock
                                                          // Configuration
#define MEMCFG_MSGXRAMTEST_LOCK_CLA1TODMA   0x20U         // MSGxRAMTEST_LOCK.CLA1TODMALock
                                                          // Configuration
#define MEMCFG_MSGXRAMTEST_LOCK_DMATOCLA1   0x40U         // MSGxRAMTEST_LOCK.DMATOCLA1Lock
                                                          // Configuration
#define MEMCFG_MSGXRAMTEST_LOCK_KEY_S       16U
#define MEMCFG_MSGXRAMTEST_LOCK_KEY_M       0xFFFF0000U   // KEY to enable write to lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the ROM_LOCK register
//
//*************************************************************************************************
#define MEMCFG_ROM_LOCK_LOCK_BOOTROM      0x1U          // BOOTROM Lock bits
#define MEMCFG_ROM_LOCK_LOCK_SECUREROM    0x2U          // SECUREROM Lock bits
#define MEMCFG_ROM_LOCK_LOCK_CLADATAROM   0x4U          // CLADATAROM Lock bits
#define MEMCFG_ROM_LOCK_LOCK_CLAPROGROM   0x8U          // CLAPROGROM Lock bits
#define MEMCFG_ROM_LOCK_KEY_S             16U
#define MEMCFG_ROM_LOCK_KEY_M             0xFFFF0000U   // Key for writing ROM LOCK

//*************************************************************************************************
//
// The following are defines for the bit fields in the ROM_TEST register
//
//*************************************************************************************************
#define MEMCFG_ROM_TEST_TEST_BOOTROM_S      0U
#define MEMCFG_ROM_TEST_TEST_BOOTROM_M      0x3U    // Selects the different modes for BOOTROM
#define MEMCFG_ROM_TEST_TEST_SECUREROM_S    2U
#define MEMCFG_ROM_TEST_TEST_SECUREROM_M    0xCU    // Selects the different modes for SECUREROM
#define MEMCFG_ROM_TEST_TEST_CLADATAROM_S   4U
#define MEMCFG_ROM_TEST_TEST_CLADATAROM_M   0x30U   // Selects the different modes for CLADATAROM
#define MEMCFG_ROM_TEST_TEST_CLAPROGROM_S   6U
#define MEMCFG_ROM_TEST_TEST_CLAPROGROM_M   0xC0U   // Selects the different modes for CLAPROGROM

//*************************************************************************************************
//
// The following are defines for the bit fields in the ROM_FORCE_ERROR register
//
//*************************************************************************************************
#define MEMCFG_ROM_FORCE_ERROR_FORCE_BOOTROM_ERROR      0x1U   // Force Bootrom Parity Error
#define MEMCFG_ROM_FORCE_ERROR_FORCE_SECUREROM_ERROR    0x2U   // Force SECUREROM Parity Error
#define MEMCFG_ROM_FORCE_ERROR_FORCE_CLADATAROM_ERROR   0x4U   // Force CLADATAROM Parity Error
#define MEMCFG_ROM_FORCE_ERROR_FORCE_CLAPROGROM_ERROR   0x8U   // Force CLAPROGROM Parity Error


//*************************************************************************************************
//
// The following are defines for the bit fields in the NMAVFLG register
//
//*************************************************************************************************
#define MEMCFG_NMAVFLG_CPUREAD     0x1U      // Non Master CPU Read Access Violation Flag
#define MEMCFG_NMAVFLG_CPUWRITE    0x2U      // Non Master CPU Write Access Violation Flag
#define MEMCFG_NMAVFLG_CPUFETCH    0x4U      // Non Master CPU Fetch Access Violation Flag
#define MEMCFG_NMAVFLG_DMAWRITE    0x8U      // Non Master DMA Write Access Violation Flag
#define MEMCFG_NMAVFLG_CLA1READ    0x10U     // Non Master CLA1 Read Access Violation Flag
#define MEMCFG_NMAVFLG_CLA1WRITE   0x20U     // Non Master CLA1 Write Access Violation Flag
#define MEMCFG_NMAVFLG_CLA1FETCH   0x40U     // Non Master CLA1 Fetch Access Violation Flag
#define MEMCFG_NMAVFLG_DMAREAD     0x400U    // Non Master DMA Read Access Violation Flag
#define MEMCFG_NMAVFLG_HICREAD     0x800U    // Non Master HIC Read Access Violation Flag
#define MEMCFG_NMAVFLG_HICWRITE    0x1000U   // Non Master HIC Write Access Violation Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the NMAVSET register
//
//*************************************************************************************************
#define MEMCFG_NMAVSET_CPUREAD     0x1U      // Non Master CPU Read Access Violation Flag Set
#define MEMCFG_NMAVSET_CPUWRITE    0x2U      // Non Master CPU Write Access Violation Flag Set
#define MEMCFG_NMAVSET_CPUFETCH    0x4U      // Non Master CPU Fetch Access Violation Flag Set
#define MEMCFG_NMAVSET_DMAWRITE    0x8U      // Non Master DMA Write Access Violation Flag Set
#define MEMCFG_NMAVSET_CLA1READ    0x10U     // Non Master CLA1 Read Access Violation Flag Set
#define MEMCFG_NMAVSET_CLA1WRITE   0x20U     // Non Master CLA1 Write Access Violation Flag Set
#define MEMCFG_NMAVSET_CLA1FETCH   0x40U     // Non Master CLA1 Fetch Access Violation Flag Set
#define MEMCFG_NMAVSET_DMAREAD     0x400U    // Non Master DMA Read Access Violation Flag Set
#define MEMCFG_NMAVSET_HICREAD     0x800U    // Non Master HIC Read Access Violation Flag Set
#define MEMCFG_NMAVSET_HICWRITE    0x1000U   // Non Master HIC Write Access Violation Flag Set

//*************************************************************************************************
//
// The following are defines for the bit fields in the NMAVCLR register
//
//*************************************************************************************************
#define MEMCFG_NMAVCLR_CPUREAD     0x1U      // Non Master CPU Read Access Violation Flag Clear
#define MEMCFG_NMAVCLR_CPUWRITE    0x2U      // Non Master CPU Write Access Violation Flag Clear
#define MEMCFG_NMAVCLR_CPUFETCH    0x4U      // Non Master CPU Fetch Access Violation Flag Clear
#define MEMCFG_NMAVCLR_DMAWRITE    0x8U      // Non Master DMA Write Access Violation Flag Clear
#define MEMCFG_NMAVCLR_CLA1READ    0x10U     // Non Master CLA1 Read Access Violation Flag Clear
#define MEMCFG_NMAVCLR_CLA1WRITE   0x20U     // Non Master CLA1 Write Access Violation Flag Clear
#define MEMCFG_NMAVCLR_CLA1FETCH   0x40U     // Non Master CLA1 Fetch Access Violation Flag Clear
#define MEMCFG_NMAVCLR_DMAREAD     0x400U    // Non Master DMA Read Access Violation Flag Clear
#define MEMCFG_NMAVCLR_HICREAD     0x800U    // Non Master HIC Read Access Violation Flag Clear
#define MEMCFG_NMAVCLR_HICWRITE    0x1000U   // Non Master HIC Write Access Violation Flag Clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the NMAVINTEN register
//
//*************************************************************************************************
#define MEMCFG_NMAVINTEN_CPUREAD     0x1U      // Non Master CPU Read Access Violation Interrupt
                                               // Enable
#define MEMCFG_NMAVINTEN_CPUWRITE    0x2U      // Non Master CPU Write Access Violation Interrupt
                                               // Enable
#define MEMCFG_NMAVINTEN_CPUFETCH    0x4U      // Non Master CPU Fetch Access Violation Interrupt
                                               // Enable
#define MEMCFG_NMAVINTEN_DMAWRITE    0x8U      // Non Master DMA Write Access Violation Interrupt
                                               // Enable
#define MEMCFG_NMAVINTEN_CLA1READ    0x10U     // Non Master CLA1 Read Access Violation Interrupt
                                               // Enable
#define MEMCFG_NMAVINTEN_CLA1WRITE   0x20U     // Non Master CLA1 Write Access Violation Interrupt
                                               // Enable
#define MEMCFG_NMAVINTEN_CLA1FETCH   0x40U     // Non Master CLA1 Fetch Access Violation Interrupt
                                               // Enable
#define MEMCFG_NMAVINTEN_DMAREAD     0x400U    // Non Master DMA Read Access Violation Interrupt
                                               // Enable
#define MEMCFG_NMAVINTEN_HICREAD     0x800U    // Non Master HIC Read Access Violation Interrupt
                                               // Enable
#define MEMCFG_NMAVINTEN_HICWRITE    0x1000U   // Non Master HIC Write Access Violation Interrupt
                                               // Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the MAVFLG register
//
//*************************************************************************************************
#define MEMCFG_MAVFLG_CPUFETCH    0x1U   // Master CPU Fetch Access Violation Flag
#define MEMCFG_MAVFLG_CPUWRITE    0x2U   // Master CPU Write Access Violation Flag
#define MEMCFG_MAVFLG_DMAWRITE    0x4U   // Master DMA Write Access Violation Flag
#define MEMCFG_MAVFLG_HICAWRITE   0x8U   // Master HICA Write Access Violation Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the MAVSET register
//
//*************************************************************************************************
#define MEMCFG_MAVSET_CPUFETCH    0x1U   // Master CPU Fetch Access Violation Flag Set
#define MEMCFG_MAVSET_CPUWRITE    0x2U   // Master CPU Write Access Violation Flag Set
#define MEMCFG_MAVSET_DMAWRITE    0x4U   // Master DMA Write Access Violation Flag Set
#define MEMCFG_MAVSET_HICAWRITE   0x8U   // Master HICA Write Access Violation Flag Set

//*************************************************************************************************
//
// The following are defines for the bit fields in the MAVCLR register
//
//*************************************************************************************************
#define MEMCFG_MAVCLR_CPUFETCH    0x1U   // Master CPU Fetch Access Violation Flag Clear
#define MEMCFG_MAVCLR_CPUWRITE    0x2U   // Master CPU Write Access Violation Flag Clear
#define MEMCFG_MAVCLR_DMAWRITE    0x4U   // Master DMA Write Access Violation Flag Clear
#define MEMCFG_MAVCLR_HICAWRITE   0x8U   // Master HICA Write Access Violation Flag Clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the MAVINTEN register
//
//*************************************************************************************************
#define MEMCFG_MAVINTEN_CPUFETCH    0x1U   // Master CPU Fetch Access Violation Interrupt Enable
#define MEMCFG_MAVINTEN_CPUWRITE    0x2U   // Master CPU Write Access Violation Interrupt Enable
#define MEMCFG_MAVINTEN_DMAWRITE    0x4U   // Master DMA Write Access Violation Interrupt Enable
#define MEMCFG_MAVINTEN_HICAWRITE   0x8U   // Master HICA Write Access Violation Interrupt Enable


//*************************************************************************************************
//
// The following are defines for the bit fields in the UCERRFLG register
//
//*************************************************************************************************
#define MEMCFG_UCERRFLG_CPURDERR    0x1U    // CPU Uncorrectable Read Error Flag
#define MEMCFG_UCERRFLG_DMARDERR    0x2U    // DMA Uncorrectable Read Error Flag
#define MEMCFG_UCERRFLG_CLA1RDERR   0x4U    // CLA1 Uncorrectable Read Error Flag
#define MEMCFG_UCERRFLG_HICARDERR   0x20U   // HICA Uncorrectable Read Error Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the UCERRSET register
//
//*************************************************************************************************
#define MEMCFG_UCERRSET_CPURDERR    0x1U    // CPU Uncorrectable Read Error Flag Set
#define MEMCFG_UCERRSET_DMARDERR    0x2U    // DMA Uncorrectable Read Error Flag Set
#define MEMCFG_UCERRSET_CLA1RDERR   0x4U    // CLA1 Uncorrectable Read Error Flag Set
#define MEMCFG_UCERRSET_HICARDERR   0x20U   // HICA Uncorrectable Read Error Flag Set

//*************************************************************************************************
//
// The following are defines for the bit fields in the UCERRCLR register
//
//*************************************************************************************************
#define MEMCFG_UCERRCLR_CPURDERR    0x1U    // CPU Uncorrectable Read Error Flag Clear
#define MEMCFG_UCERRCLR_DMARDERR    0x2U    // DMA Uncorrectable Read Error Flag Clear
#define MEMCFG_UCERRCLR_CLA1RDERR   0x4U    // CLA1 Uncorrectable Read Error Flag Clear
#define MEMCFG_UCERRCLR_HICARDERR   0x20U   // HICA Uncorrectable Read Error Flag Clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the CERRFLG register
//
//*************************************************************************************************
#define MEMCFG_CERRFLG_CPURDERR    0x1U    // CPU Correctable Read Error Flag
#define MEMCFG_CERRFLG_DMARDERR    0x2U    // DMA Correctable Read Error Flag
#define MEMCFG_CERRFLG_CLA1RDERR   0x4U    // CLA1 Correctable Read Error Flag
#define MEMCFG_CERRFLG_HICRDERR    0x20U   // HIC Correctable Read Error Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the CERRSET register
//
//*************************************************************************************************
#define MEMCFG_CERRSET_CPURDERR    0x1U    // CPU Correctable Read Error Flag Set
#define MEMCFG_CERRSET_DMARDERR    0x2U    // DMA Correctable Read Error Flag Set
#define MEMCFG_CERRSET_CLA1RDERR   0x4U    // CLA1 Correctable Read Error Flag Set
#define MEMCFG_CERRSET_HICRDERR    0x20U   // HIC Correctable Read Error Flag Set

//*************************************************************************************************
//
// The following are defines for the bit fields in the CERRCLR register
//
//*************************************************************************************************
#define MEMCFG_CERRCLR_CPURDERR    0x1U    // CPU Correctable Read Error Flag Clear
#define MEMCFG_CERRCLR_DMARDERR    0x2U    // DMA Correctable Read Error Flag Clear
#define MEMCFG_CERRCLR_CLA1RDERR   0x4U    // CLA1 Correctable Read Error Flag Clear
#define MEMCFG_CERRCLR_HICRDERR    0x20U   // HIC Correctable Read Error Flag Clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the CERRTHRES register
//
//*************************************************************************************************
#define MEMCFG_CERRTHRES_CERRTHRES_S   0U
#define MEMCFG_CERRTHRES_CERRTHRES_M   0xFFFFU   // Correctable error threshold.

//*************************************************************************************************
//
// The following are defines for the bit fields in the CEINTFLG register
//
//*************************************************************************************************
#define MEMCFG_CEINTFLG_CEINTFLAG   0x1U   // Total corrected error count exceeded threshold flag.

//*************************************************************************************************
//
// The following are defines for the bit fields in the CEINTCLR register
//
//*************************************************************************************************
#define MEMCFG_CEINTCLR_CEINTCLR   0x1U   // CPU Corrected Error Threshold Exceeded Error Clear.

//*************************************************************************************************
//
// The following are defines for the bit fields in the CEINTSET register
//
//*************************************************************************************************
#define MEMCFG_CEINTSET_CEINTSET   0x1U   // Total corrected error count exceeded flag set.

//*************************************************************************************************
//
// The following are defines for the bit fields in the CEINTEN register
//
//*************************************************************************************************
#define MEMCFG_CEINTEN_CEINTEN   0x1U   // CPU/DMA Correctable Error Interrupt Enable.


//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU_RAM_TEST_ERROR_STS register
//
//*************************************************************************************************
#define MEMCFG_CPU_RAM_TEST_ERROR_STS_COR_ERROR   0x1U   // COR_ERROR flag
#define MEMCFG_CPU_RAM_TEST_ERROR_STS_UNC_ERROR   0x2U   // UNC_ERROR flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU_RAM_TEST_ERROR_STS_CLR register
//
//*************************************************************************************************
#define MEMCFG_CPU_RAM_TEST_ERROR_STS_CLR_COR_ERROR   0x1U   // COR_ERROR flag clear bit
#define MEMCFG_CPU_RAM_TEST_ERROR_STS_CLR_UNC_ERROR   0x2U   // UNC_ERROR flag clear bit



#endif
